In [3]:
#Konversi Tipe Data Numerik Pada Kolom Data Frame
#LeonyCornelia-2373002

In [8]:
import pandas as pd

print(pd.__version__)

2.1.4

In [10]:
#Persiapan Data Frame
data = {'col1':['1', '2', '3', 'teks'], 
        'col2':['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [12]:
df.dtypes

col1    object
col2    object
dtype: object

In [14]:
#Konversi Tipe Data Dengan Fungsi astype()
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [16]:
df_x.dtypes

col1    object
col2     int64
dtype: object

In [18]:
df_x = df.astype({'col2':'float'})
df_x

   col1  col2
0     1   1.0
1     2   2.0
2     3   3.0
3  teks   4.0

In [20]:
df_x.dtypes

col1     object
col2    float64
dtype: object

In [24]:
#Konversi Tipe Data Numerik Dengan Fungsi to_numeric()
df.apply(pd.to_numeric, errors = 'coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4